backend/app/controllers/application_controller.rb

  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    decoded = JsonWebToken.decode_token(token)
    @current_user = User.find_by(id: decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]