backend/app/controllers/api/v1/auth_controller.rb

  def login
    @user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user12@example.com"], ["LIMIT", 1]]

  def signup
    @user = User.create(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "user13@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-12-06 09:24:21.467361"], ["updated_at", "2024-12-06 09:24:21.467361"]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "user@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-12-06 07:22:42.486486"], ["updated_at", "2024-12-06 07:22:42.486486"]]