backend/app/controllers/api/v1/cars_controller.rb

SELECT "cars".* FROM "cars"
SELECT COUNT(*) FROM "cars"
---
  def index
    @cars = Car.paginate(page: params[:page], per_page: 20) || []

INSERT INTO "cars" ("plate_number", "model", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["plate_number", "aas32w2"], ["model", "chevrolet"], ["year", 2020], ["created_at", "2024-12-06 07:58:55.768969"], ["updated_at", "2024-12-06 07:58:55.768969"]]
---
  def create
    @car = Car.new(car_params)

    if @car.save

UPDATE "cars" SET "plate_number" = $1, "model" = $2, "updated_at" = $3 WHERE "cars"."id" = $4  [["plate_number", "23232"], ["model", "chevrolet"], ["updated_at", "2024-12-06 06:42:07.863220"], ["id", 1]]
---
  def update
    if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 1]]
---
  def destroy
    @car.destroy!