backend/app/controllers/api/v1/maintenance_services_controller.rb

  def index
    @maintenance_services = MaintenanceService.paginate(page: params[:page].to_i, per_page: 10)
---
SELECT COUNT(*) FROM "maintenance_services"
SELECT "maintenance_services".* FROM "maintenance_services" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @maintenance_service = MaintenanceService.new(maintenance_service_params)

    if @maintenance_service.save
---
INSERT INTO "maintenance_services" ("car_id", "description", "status", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @maintenance_service.update(maintenance_service_params)
---
UPDATE "maintenance_services" SET "description" = $1, "status" = $2, "updated_at" = $3 WHERE "maintenance_services"."id" = $4  [["description", "description maintenance servicec22222222222"], ["status", "completed"], ["updated_at", "2024-12-06 11:54:58.500087"], ["id", 4]]

  def destroy
    @maintenance_service.destroy!
---
DELETE FROM "maintenance_services" WHERE "maintenance_services"."id" = $1  [["id", 1]]

    def set_maintenance_service
      @maintenance_service = MaintenanceService.find(params[:id])
---
SELECT "maintenance_services".* FROM "maintenance_services" WHERE "maintenance_services"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]