backend/app/controllers/api/v1/maintenance_services_controller.rb

SELECT "maintenance_services".* FROM "maintenance_services" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "maintenance_services"
---
  def index

    status = params[:status]
    plate_number = params[:plate_number]

    maintenance_services = MaintenanceService.all

    if status.present?
      @maintenance_services = maintenance_services.where(status: status)
    end

    if plate_number.present?
      @maintenance_services = maintenance_services.joins(:car).where(cars: { plate_number: plate_number })
    end

    @maintenance_services =  MaintenanceService.paginate(page: params[:page].to_i, per_page: 10)

SELECT "maintenance_services".* FROM "maintenance_services" WHERE "maintenance_services"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_maintenance_service
      @maintenance_service = MaintenanceService.find(params[:id])